function CheckAlert() {
	$.getJSON( "http://www.oref.org.il/WarningMessages/alerts.json", function( data ) {
		//data.data = ["אשקלון 238, עוטף עזה 238"];
		correctData = CorrectDataFormat(data.data);
		if (correctData.length > 0) {
			console.log(Date());
			console.log("All alarms: " + correctData.toString());
			newAlarms = UpdateValues(correctData ,currentAlarmDict);
			if (newAlarms.length>0) {
				setRedIcon();
				console.info(Date());
				notify(newAlarms);
				console.info("New alarms: " + newAlarms.toString());
			}
		}
		RemoveStaleValues(currentAlarmDict);
	});
}

function CorrectDataFormat(rawData) {
	newData = [];
	if (rawData == null)
		return null;
	for(var i=0;i<rawData.length;i++) {
		newData =$.extend(true, newData, rawData[i].split(","));		
	}
	newData = $.map(newData, $.trim);
	return newData;
}


function UpdateValues(data,dict) {
	newValues = [];
	for(var i=0;i<data.length;i++) {
		if (!(data[i] in dict)) {
			newValues.push(data[i]);
		}
		dict[data[i]] = Math.floor(alarmValidTime / refreshTime);
	}
	return newValues;
}

function RemoveStaleValues(data) {
	for (var key in data) { 		
		data[key]=data[key]-1;
		if (data[key]<=0) {
			delete data[key];
		}
	}
	return data;
}

var alertCount = 0;
var prevData = [];
var refreshTime = 5000;
var alarmValidTime = 30000; //30 seconds
var currentAlarmDict = {};

window.setInterval(CheckAlert, refreshTime);

function setRedIcon() {
			alertCount = alertCount + 1;
			chrome.browserAction.setIcon({path:"red.png"});
			chrome.browserAction.setBadgeText({text:alertCount.toString()});
}

function setGreenIcon() {
	alertCount = 0;
	chrome.browserAction.setBadgeText({text:""});
	chrome.browserAction.setIcon({path:"green.png"});
}

function notify(data) {
	var town_data = "";
	for (i=0;i<data.length;i++) {
		town_data = town_data + town_list[data[i]] + ", ";
	}
	var opt = {
	   type: "basic",
	   title: "Alert",
	   message: town_data,
	   iconUrl: "alert_large.jpg"
	};
	chrome.notifications.create("", opt, function(id) {	  
	});
	console.info(town_data);
}

town_list = {"אילת 311":"חבל אילות",
"אשדוד 263":"תחנת הכוח אשדוד",
"אשדוד 264":"תחנת הכוח צפית",
"אשדוד 266":"גן רווה",
"אשדוד 267":"חבל יבנה",
"אשדוד 268":"ברנר",
"אשדוד 271":"אשדוד",
"אשדוד 272":"באר טוביה",
"אשדוד 273":"באר טוביה",
"אשדוד 275":"באר טוביה",
"אשדוד 276":"שפיר",
"אשדוד 277":"כנף 2",
"אשדוד 278":"מטה יהודה",
"אשדוד 280":"שפיר",
"אשדוד 281":"שפיר",
"אשדוד 282":"יואב",
"אשדוד 282":"יואב",
"אשקלון 234":"אשכול",
"אשקלון 238":"אשכול",
"אשקלון 239":"תחנת הכוח רוטנברג",
"אשקלון 245":"חוף אשקלון",
"אשקלון 246":"אשקלון",
"אשקלון 247":"אזור תעשייה אשקלון",
"אשקלון 248":"חוף אשקלון",
"אשקלון 249":"לכיש",
"אשקלון 250":"חוף אשקלון",
"אשקלון 251":"שער הנגב",
"אשקלון 252":"שער הנגב",
"אשקלון 253":"מרחבים",
"אשקלון 254":"אזור תעשייה נ.ע.מ",
"אשקלון 255":"בני שמעון",
"אשקלון 256":"אשכול",
"אשקלון 257":"אשכול",
"באר שבע 285":"אל בירה בהר חברון",
"באר שבע 286":"אל הייל",
"באר שבע 286":"בני שמעון",
"באר שבע 288":"אופקים",
"באר שבע 289":"אשל הנשיא בי''ס אזורי",
"באר שבע 291":"בני שמעון",
"באר שבע 292":"באר שבע",
"בית שמש 188":"מטה יהודה",
"בית שמש 189":"אבו גוש",
"בית שמש 190":"בידו",
"בית שמש 191":"מטה יהודה",
"בקעה 130":"ערבות הירדן",
"בקעה 131":"ערבות הירדן",
"בקעה 132":"ערבות הירדן",
"בקעה 133":"אלון",
"בקעת בית שאן 128":"אזור תעשיות צבאים",
"גולן 1":"גולן",
"גולן 2":"גולן",
"גולן 3":"גולן",
"גליל עליון 35":"מטה אשר",
"גליל עליון 37":"מטה אשר",
"גליל עליון 38":"אבו סנאן",
"גליל עליון 40":"משגב",
"גליל עליון 41":"יאנוח ג'ת",
"גליל עליון 42":"בענה",
"גליל עליון 43":"בית ג'ן",
"גליל עליון 44":"מרום הגליל",
"גליל עליון 46":"ספסופה",
"גליל עליון 47":"הגליל העליון",
"גליל עליון 49":"מרום הגליל",
"גליל עליון 50":"מבואות החרמון",
"גליל תחתון 55":"הגליל התחתון",
"גליל תחתון 56":"טבריה",
"גליל תחתון 57":"מרום הגליל",
"גליל תחתון 60":"משגב",
"גליל תחתון 61":"הגליל התחתון",
"גליל תחתון 63":"אבו דיאב",
"דן 162":"אזור",
"דן 155":"חוף השרון",
"דן 157":"תל אביב יפו",
"דן 158":"תחנת הכוח רידינג",
"דן 160":"בני ברק",
"דן 161":"אור יהודה",
"הקריות 70":"אזור תעשייה נעמן",
"הקריות 71":"זבולון",
"חיפה 75":"חוף הכרמל",
"חיפה 77":"תחנת הכוח חיפה",
"חיפה 78":"נמל חיפה",
"יהודה 188":"אום עלאס",
"יהודה 200":"אבו נוג'ים",
"יהודה 206":"אל ערוב",
"יהודה 207":"הר חברון",
"ים המלח 207":"ים המלח בתי מלון",
"ים המלח 210":"מגילות ים המלח",
"ירושלים 194":"אבו דיס",
"כרמל 80":"בתי זיקוק חיפה",
"כרמל 81":"חוף הכרמל",
"כרמל 82":"חוף הכרמל",
"מנשה 102":"חוף הכרמל",
"מנשה 103":"מגידו",
"מנשה 104":"אלונה",
"מנשה 105":"אור עקיבא",
"מנשה 106":"מנשה",
"מנשה 107":"חדרה",
"מנשה 108":"גבעת חביבה",
"מנשה 110":"תחנת הכוח חגית",
"מעלה אדומים 200":"ג'האלין",
"נגב 287":"אבו טראש",
"נגב 296":"אל קסום",
"נגב 297":"אבו קוידר",
"נגב 299":"אבו ג'ויעד",
"נגב 300":"אבו עפאש",
"נגב 301":"אורון",
"נגב 302":"רמת נגב",
"נגב 305":"רמת נגב",
"נגב 306":"תחנת הכוח רמת חובב",
"עוטף עזה 216":"שדות נגב",
"עוטף עזה 217":"חוף אשקלון",
"עוטף עזה 218":"חוף אשקלון",
"עוטף עזה 219":"שער הנגב",
"עוטף עזה 220":"שער הנגב",
"עוטף עזה 221":"שער הנגב",
"עוטף עזה 222":"שער הנגב",
"עוטף עזה 223":"שער הנגב",
"עוטף עזה 224":"שער הנגב",
"עוטף עזה 225":"שדות נגב",
"עוטף עזה 227":"אשכול",
"עוטף עזה 228":"אשכול",
"עוטף עזה 230":"אשכול",
"עוטף עזה 231":"אשכול",
"עוטף עזה 232":"אשכול",
"עוטף עזה 233":"אשכול",
"עוטף עזה 234":"אשכול",
"עוטף עזה 235":"כימדע",
"עוטף עזה 236":"אשכול",
"עוטף עזה 237":"אשכול",
"עוטף עזה 238":"אשכול",
"עוטף עזה 251":"חוף אשקלון",
"עירון 112":"אום אל קוטוף",
"עירון 113":"אום אל פחם",
"עמק חפר 137":"אלי עד",
"עמק חפר 139":"דרום השרון",
"עמק חפר 149":"עמק חפר",
"עמק חפר 150":"אזור תעשייה תנובות",
"עמק יזרעאל 86":"זבולון",
"עמק יזרעאל 87":"אזור תעשייה שגיא 2000",
"עמק יזרעאל 89":"עמק יזרעאל",
"עמק יזרעאל 90":"אזור תעשייה אלון התבור",
"עמק יזרעאל 93":"הגלבוע",
"עמק יזרעאל 94":"תחנת הכוח אלון תבור",
"ערבה 308":"חבל אילות",
"ערבה 310":"אזור תעשייה ספיר",
"קו העימות 14":"אזור תעשייה אכזיב מילואות",
"קו העימות 15":"מטה אשר",
"קו העימות 16":"מעלה יוסף",
"קו העימות 17":"מעלה יוסף",
"קו העימות 19":"דוב''ב",
"קו העימות 20":"חורפיש",
"קו העימות 22":"מרום הגליל",
"קו העימות 23":"מרום הגליל",
"קו העימות 24":"מבואות החרמון",
"קו העימות 25":"הגליל העליון",
"קו העימות 26":"מבואות החרמון",
"קו העימות 28":"הגליל העליון",
"קו העימות 29":"מטה אשר",
"קו העימות 29":"מטה אשר",
"קו העימות 30":"בי''ס אזורי מקיף מטה אשר",
"קו העימות 31":"מטה אשר",
"קו העימות 32":"מעלה יוסף",
"קצרין 10":"עמק הירדן",
"קצרין 7":"גולן",
"שומרון 118":"אום א ריחאן",
"שומרון 119":"אום א תות",
"שומרון 120":"שומרון",
"שומרון 121":"אבו סלמאן",
"שומרון 122":"אריאל",
"שומרון 123":"בית אריה",
"שומרון 124":"אום ספא",
"שומרון 125":"אזור תעשייה שער בנימין",
"שומרון 126":"אבו קש",
"שומרון 127":"בית איגיזא",
"שפלה 168":"דרום השרון",
"שפלה 169":"אלעד",
"שפלה 170":"דרום השרון",
"שפלה 171":"מחנה נחשונים",
"שפלה 172":"נמל תעופה בן גוריון",
"שפלה 173":"חבל מודיעין",
"שפלה 174":"עמק לוד",
"שפלה 175":"גן רווה",
"שפלה 178":"באר יעקב",
"שפלה 179":"חבל מודיעין",
"שפלה 181":"בודרוס",
"שפלה 182":"אירוס",
"שפלה 183":"גן רווה",
"שפלה 184":"גזר",
"שפלה 186":"תחנת הכוח גזר",
"שפלה 187":"מתקן התפלה פלמחים",
"שרון 137":"בית חרות",
"שרון 138":"עמק חפר",
"שרון 140":"גבעת ח''ן",
"שרון 141":"דרום השרון",
"שרון 142":"אבן יהודה",
"שרון 143":"אורנית",
"תבור 95":"אכסאל",
"תבור 96":"הגליל התחתון",
"תבור 98":"אוהלו"};
