function CheckAlert() {
	$.getJSON( "http://www.oref.org.il/WarningMessages/alerts.json", function( data ) {
		//data.data = ["אשקלון 235, עוטף עזה 238, מנשה 102"];
		correctData = CorrectDataFormat(data.data);
		if (correctData.length > 0) {
			console.log(Date());
			console.log("Raw alarms: " + data.data.toString());
			console.log("All alarms: " + correctData.toString());
			newAlarms = UpdateValues(correctData ,currentAlarmDict);
			if (newAlarms.length>0) {
				setRedIcon();
				console.info(Date());
				notify(newAlarms);
				console.info("New alarms: " + newAlarms.toString());
			}
		}
		RemoveStaleValues(currentAlarmDict);
	});
}

function CorrectDataFormat(rawData) {
	newData = [];
	if (rawData == null)
		return null;
	for(var i=0;i<rawData.length;i++) {
		newData = $.merge(newData, rawData[i].split(","));
	}
	newData = $.map(newData, $.trim);
	return newData;
}


function UpdateValues(data,dict) {
	newValues = [];
	for(var i=0;i<data.length;i++) {
		if (!(data[i] in dict)) {
			newValues.push(data[i]);
		}
		dict[data[i]] = Math.floor(alarmValidTime / refreshTime);
	}
	return newValues;
}

function RemoveStaleValues(data) {
	for (var key in data) { 		
		data[key]=data[key]-1;
		if (data[key]<=0) {
			delete data[key];
		}
	}
	return data;
}

var alertCount = 0;
var prevData = [];
var refreshTime = 5000;
var alarmValidTime = 30000; //30 seconds
var currentAlarmDict = {};

window.setInterval(CheckAlert, refreshTime);

function setRedIcon() {
			alertCount = alertCount + 1;
			chrome.browserAction.setIcon({path:"red.png"});
			chrome.browserAction.setBadgeText({text:alertCount.toString()});
}

function setGreenIcon() {
	alertCount = 0;
	chrome.browserAction.setBadgeText({text:""});
	chrome.browserAction.setIcon({path:"green.png"});
}

function notify(data) {
	var town_data = [];
	for (i=0;i<data.length;i++) {
		town_data.push(town_list[data[i]]);
	}
	var town_data_string = "";

	utown_data = unique(town_data);
	for (i=0;i<utown_data.length;i++) {
		town_data_string = town_data_string + utown_data[i];
		if (i<utown_data.length-1) {
			town_data_string = town_data_string + ", ";
		}
	}

	var opt = {
	   type: "basic",
	   title: "Alert",
	   message: town_data_string,
	   iconUrl: "alert_large.jpg"
	};
	chrome.notifications.create("", opt, function(id) {	  
	});
	console.info(town_data);
}

function unique(list) {
	var uniq=list.filter(function(itm,i,list){
		return i==list.indexOf(itm);
	});
	return uniq;
}

town_list = {
"אילת 311":"אילת",
"אשדוד 263":"תחנת הכוח אשדוד",
"אשדוד 264":"תחנת הכוח צפית",
"אשדוד 266":"יבנה",
"אשדוד 267":"מא חבל יבנה",
"אשדוד 268":"גדרה",
"אשדוד 271":"אשדוד",
"אשדוד 272":"מא באר טוביה",
"אשדוד 273":"גן יבנה",
"אשדוד 275":"מא באר טוביה",
"אשדוד 276":"מא שפיר",
"אשדוד 277":"כנף 2",
"אשדוד 278":"מא מטה יהודה",
"אשדוד 280":"מא שפיר",
"אשדוד 281":"מא שפיר",
"אשדוד 282":"מא יואב",
"אשדוד 282":"מא יואב",
"אשקלון 234":"מא אשכול",
"אשקלון 238":"מא אשכול",
"אשקלון 239":"תחנת הכוח רוטנברג",
"אשקלון 245":"מא חוף אשקלון",
"אשקלון 246":"אשקלון",
"אשקלון 247":"אזור תעשייה אשקלון",
"אשקלון 248":"מא חוף אשקלון",
"אשקלון 249":"מא לכיש",
"אשקלון 250":"מא חוף אשקלון",
"אשקלון 251":"מא שער הנגב",
"אשקלון 252":"מא שער הנגב",
"אשקלון 253":"מא מרחבים",
"אשקלון 254":"נתיבות",
"אשקלון 255":"מא בני שמעון",
"אשקלון 256":"מא אשכול",
"אשקלון 257":"מא אשכול",
"באר שבע 285":"אל בירה בהר חברון",
"באר שבע 286":"רהט",
"באר שבע 286":"מא בני שמעון",
"באר שבע 288":"אופקים",
"באר שבע 289":"אשל הנשיא בי''ס אזורי",
"באר שבע 291":"מא בני שמעון",
"באר שבע 292":"באר שבע",
"בית שמש  188":"בית שמש",
"בית שמש 189":"אבו גוש",
"בית שמש 190":"מבשרת ציון",
"בית שמש 191":"צור הדסה",
"בקעה 130":"מא ערבות הירדן",
"בקעה 131":"מא ערבות הירדן",
"בקעה 132":"מא ערבות הירדן",
"בקעה 133":"אלון",
"בקעת בית שאן 128":"בית שאן",
"גולן 1":"מג'דל שמס",
"גולן 2":"מא גולן",
"גולן 3":"מא גולן",
"גליל עליון 35":"מא מטה אשר",
"גליל עליון 37":"עכו",
"גליל עליון 38":"ירכא",
"גליל עליון 40":"מא משגב",
"גליל עליון 41":"יאנוח ג'ת",
"גליל עליון 42":"כרמיאל",
"גליל עליון 43":"בית ג'ן",
"גליל עליון 44":"מא מרום הגליל",
"גליל עליון 46":"ספסופה",
"גליל עליון 47":"מא הגליל העליון",
"גליל עליון 49":"צפת",
"גליל עליון 50":"חצור הגלילית",
"גליל תחתון 55":"מא הגליל התחתון",
"גליל תחתון 56":"טבריה",
"גליל תחתון 57":"עיילבון",
"גליל תחתון 60":"סח'נין",
"גליל תחתון 61":"מא הגליל התחתון",
"גליל תחתון 63":"שפרעם",
"דן 162":"חולון",
"דן 155":"רמת השרון",
"דן 157":"תל אביב יפו",
"דן 158":"תחנת הכוח רידינג",
"דן 160":"בני ברק",
"דן 161":"אור יהודה",
"הקריות 70":"אזור תעשייה נעמן",
"הקריות 71":"רכסים",
"חיפה 75":"חיפה",
"חיפה 77":"תחנת הכוח חיפה",
"חיפה 78":"נמל חיפה",
"יהודה 188":"אום עלאס",
"יהודה 200":"אבו נוג'ים",
"יהודה 206":"ביתר עילית",
"יהודה 207":"מא הר חברון",
"ים המלח 207":"ים המלח בתי מלון",
"ים המלח 210":"מא מגילות ים המלח",
"ירושלים  194":"ירושלים",
"כרמל 80":"נשר",
"כרמל 81":"עתלית",
"כרמל 82":"מא חוף הכרמל",
"מנשה 102":"זכרון יעקב",
"מנשה 103":"מא מגידו",
"מנשה 104":"מא אלונה",
"מנשה 105":"אור עקיבא",
"מנשה 106":"מא מנשה",
"מנשה 107":"חדרה",
"מנשה 108":"גבעת חביבה",
"מנשה 110":"תחנת הכוח חגית",
"מעלה אדומים 200":"מעלה אדומים",
"נגב 287":"תל שבע",
"נגב 296":"חורה",
"נגב 297":"אבו קוידר",
"נגב 299":"ערד",
"נגב 300":"אבו עפאש",
"נגב 301":"דימונה",
"נגב 302":"מא רמת נגב",
"נגב 305":"מצפה רמון",
"נגב 306":"תחנת הכוח רמת חובב",
"עוטף עזה 216":"מא שדות נגב",
"עוטף עזה 217":"מא חוף אשקלון",
"עוטף עזה 218":"מא חוף אשקלון",
"עוטף עזה 219":"מא שער הנגב",
"עוטף עזה 220":"שדרות",
"עוטף עזה 221":"מא שער הנגב",
"עוטף עזה 222":"מא שער הנגב",
"עוטף עזה 223":"מא שער הנגב",
"עוטף עזה 224":"מא שער הנגב",
"עוטף עזה 225":"מא שדות נגב",
"עוטף עזה 227":"מא אשכול",
"עוטף עזה 228":"מא אשכול",
"עוטף עזה 230":"מא אשכול",
"עוטף עזה 231":"מא אשכול",
"עוטף עזה 232":"מא אשכול",
"עוטף עזה 233":"מא אשכול",
"עוטף עזה 234":"מא אשכול",
"עוטף עזה 235":"כימדע",
"עוטף עזה 236":"מא אשכול",
"עוטף עזה 237":"מא אשכול",
"עוטף עזה 238":"מא אשכול",
"עוטף עזה 251":"מא חוף אשקלון",
"עירון 112":"ערערה",
"עירון 113":"מעלה עירון",
"עמק חפר 137":"אלי עד",
"עמק חפר 139":"טייבה",
"עמק חפר 149":"ג'ת",
"עמק חפר 150":"כפר יונה",
"עמק יזרעאל 86":"בסמת טבעון",
"עמק יזרעאל 87":"מגדל העמק",
"עמק יזרעאל 89":"מא עמק יזרעאל",
"עמק יזרעאל 90":"עפולה",
"עמק יזרעאל 93":"מא הגלבוע",
"עמק יזרעאל 94":"תחנת הכוח אלון תבור",
"ערבה 308":"מא חבל אילות",
"ערבה 310":"אזור תעשייה ספיר",
"קו העימות 14":"שלומי",
"קו העימות 15":"מא מטה אשר",
"קו העימות 16":"מא מעלה יוסף",
"קו העימות 17":"מא מעלה יוסף",
"קו העימות 19":"דוב''ב",
"קו העימות 20":"חורפיש",
"קו העימות 22":"מא מרום הגליל",
"קו העימות 23":"מא מרום הגליל",
"קו העימות 24":"מא מבואות החרמון",
"קו העימות 25":"מא הגליל העליון",
"קו העימות 26":"מא מבואות החרמון",
"קו העימות 28":"מא הגליל העליון",
"קו העימות 29":"מא מטה אשר",
"קו העימות 29":"מא מטה אשר",
"קו העימות 30":"בי''ס אזורי מקיף מטה אשר",
"קו העימות 31":"מא מטה אשר",
"קו העימות 32":"כפר ורדים",
"קצרין 10":"מא עמק הירדן",
"קצרין 7":"קצרין",
"שומרון 118":"אום א ריחאן",
"שומרון 119":"אום א תות",
"שומרון 120":"מא שומרון",
"שומרון 121":"אלפי מנשה",
"שומרון 122":"אריאל",
"שומרון 123":"בית אריה",
"שומרון 124":"אום ספא",
"שומרון 125":"אזור תעשייה שער בנימין",
"שומרון 126":"כוכב יעקב",
"שומרון 127":"גבעת זאב",
"שפלה 168":"פתח תקווה",
"שפלה 169":"אלעד",
"שפלה 170":"מא דרום השרון",
"שפלה 171":"מחנה נחשונים",
"שפלה 172":"נמל תעופה בן גוריון",
"שפלה 173":"שוהם",
"שפלה 174":"בית דגן",
"שפלה 175":"ראשון לציון",
"שפלה 178":"רמלה",
"שפלה 179":"לוד",
"שפלה 181":"מודיעין עילית",
"שפלה 182":"רחובות",
"שפלה 183":"נס ציונה",
"שפלה 184":"מזכרת בתיה",
"שפלה 186":"תחנת הכוח גזר",
"שפלה 187":"מתקן התפלה פלמחים",
"שרון 137":"בית חרות",
"שרון 138":"נתניה",
"שרון 140":"רעננה",
"שרון 141":"כפר סבא",
"שרון 142":"אבן יהודה",
"שרון 143":"הוד השרון",
"תבור 95":"נצרת",
"תבור 96":"טורעאן",
"תבור 98":"אוהלו"
};